<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
		<string>production</string>
	</array>
	<key>category</key>
	<string>Developer Tools</string>
	<key>description</key>
	<string>This is simple wrapper for the installation process of the Xcode CommandLine Tools&lt;br&gt;
You can either use this for installation or the normal way.&lt;br&gt;
&lt;br&gt;&lt;br&gt;
This item will not notify you of future updates.

Additional Tags: CLI, CLT</string>
	<key>developer</key>
	<string>Apple Inc.</string>
	<key>display_name</key>
	<string>Xcode commandline tools</string>
	<key>icon_name</key>
	<string>Xcode.png</string>
	<key>installed_size</key>
	<integer>1258292</integer>
	<key>installer_item_size</key>
	<integer>1258292</integer>
	<key>installer_type</key>
	<string>nopkg</string>
	<key>installs</key>
	<array>
		<dict>
			<key>path</key>
			<string>/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk</string>
			<key>type</key>
			<string>file</string>
		</dict>
	</array>
	<key>minimum_os_version</key>
	<string>10.14.0</string>
	<key>name</key>
	<string>CommandLineTools</string>
	<key>notes</key>
	<string>This will simply cast the install request for CommandLine tools</string>
	<key>postinstall_script</key>
	<string>#!/usr/local/munki/munki-python

# REQUIRED LIBRARIES
import subprocess
import os, re
from time import sleep
from sys import path, version
path.append('/usr/local/munki')
from munkilib.processes import stop_requested
from munkilib.display import display_status_minor, display_percent_done, display_error

def quit_error(msg: str):
    # Remove the installer state
    try: 
        os.remove("/tmp/.com.apple.dt.CommandLineTools.installondemand.in-progress")
    except:
        pass

    display_error(msg)
    display_status_minor(msg)
    sleep(5)
    exit(1)


# Prepare download
open('/tmp/.com.apple.dt.CommandLineTools.installondemand.in-progress', 'a').close()

# Get the correct item name
display_status_minor('Scanning for installer ')
scan_result = subprocess.run(['/usr/sbin/softwareupdate', '-l'], stdout=subprocess.PIPE).stdout.decode().split('\n')
clt_available = [item for item in scan_result if 'Label:' in item and 'Command Line Tools' in item and 'beta' not in item]

if not clt_available:
    quit_error('Could not find suitable installer via SoftwareUpdate')

command_line_tools = sorted(clt_available, key = lambda title: title.split('-')[-1], reverse=True)[0].split(': ')[-1]

# DOWNLOAD THE OS FROM APPLE CDN
display_status_minor('Download started ')
download = subprocess.Popen(
    ['/usr/bin/script', '-q', '/dev/null', '/usr/sbin/softwareupdate', '--install', command_line_tools],
    bufsize=0,
    universal_newlines=True,
    stdout=subprocess.PIPE
)

skip_lines = ['.*Software Update Tool.*', '.*Finding available software.*', '*XType:*']

while download.poll() is None:
    if stop_requested():
        download.kill()
        exit(1)

    line = download.stdout.readline()

    if line is None or line.strip() == "" or any(re.compile(regex).match(line.strip()) for regex in skip_lines):
        continue

    display_status_minor(line)

if download.returncode != 0:
    quit_error('Installation of ' + command_line_tools + ' failed.')

# Remove the installer state
try: 
    os.remove("/tmp/.com.apple.dt.CommandLineTools.installondemand.in-progress")
except:
    pass

exit(0)</string>
	<key>unattended_install</key>
	<true/>
	<key>uninstall_method</key>
	<string>uninstall_script</string>
	<key>uninstall_script</key>
	<string>#!/bin/zsh

/bin/rm -rf /Library/Developer/CommandLineTools/</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>1.0</string>
</dict>
</plist>
